import pandas as pd

df = pd.read_csv('CAT_FINAL.csv')

df = df.drop(columns=['Timestamp'])
print(df.columns[:5])

#--------------------------------------------------------------------------------------

new_name = {
    'คุณเคยซื้ออาหารแมวและมีประสบการณ์เลี้ยงแมวในบ้านหรือไม่': 'had_none_1',
    'อายุของคุณ': 'age_',
    'เพศของคุณ': 'gender',
    'สถานภาพสมรส': 'status',
    'แมวมีความหมายอย่างไรต่อคุณ เช่น เป็นเหมือนลูกของเรา, เป็นเพื่อนคลายเหงา [พิมพ์ตามความรู้สึกได้เลย]': 'cat_mean_2',
    'คุณเลี้ยงแมวพันธุ์ใด [โปรดพิมพ์ระบุ]': 'cat_kind_3',
    'ปัจจุบันคุณซื้ออาหารแมวสำเร็จรูปชนิดเม็ดแบรนด์ใด[โปรดพิมพ์ระบุ]': 'brand_4',
    'คุณสมบัติของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [ใช้วัตถุดิบจากธรรมชาติ]': 'food_natural_5',
    'คุณสมบัติของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [ใช้วัตถุดิบนำเข้าจากต่างประเทศ เช่น เนื้อปลาทูน่าจากญี่ปุ่น]': 'food_import_6',
    'คุณสมบัติของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [รสชาติกลมกล่อมอร่อยถูกปากแมว เช่น เทไว้แล้วแมวกินหมดไม่เหลือ, หยิบถุงแล้วแมวรอกิน]': 'food_taste_7',
    'คุณสมบัติของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [เป็นผลิตภัณฑ์จากต่างประเทศ เช่น ญี่ปุ่น, อเมริกา]': 'food_make_import_8',
    'คุณสมบัติของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [แบรนด์มีชื่อเสียงเป็นที่รู้จัก]': 'brand_popular_9',
    'บรรจุภัณฑ์ (packaging) มีผลต่อการตัดสินใจซื้อใจหรือไม่': 'packaging_10',
    'สำหรับบรรจุภัณฑ์อาหารแมว คุณชอบภาพแบบใด': 'packaging_11',
    'บรรจุภัณฑ์ของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [บรรจุภัณฑ์ดูดีพรีเมียม]': 'packaging_12',
    'บรรจุภัณฑ์ของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [บรรจุภัณฑ์มีภาพแมว]': 'packaging_13',
    'บรรจุภัณฑ์ของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [บรรจุภัณฑ์มีภาพอาหารเม็ด รูปทรงของอาหารเม็ดจริงให้เห็น]': 'packaging_14',
    'บรรจุภัณฑ์ของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [บรรจุภัณฑ์มีภาพวัตถุดิบและส่วนผสมจริงให้เห็น]': 'packaging_15',
    'บรรจุภัณฑ์ของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [บรรจุภัณฑ์เป็นมิตรต่อสิ่งแวดล้อม]': 'packaging_16',
    'บรรจุภัณฑ์ของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [มีสัญลักษณ์สื่อถึงแหล่งผลิตหรือที่มา เช่น นำเข้าจากประเทศx]': 'packaging_17',
    'บรรจุภัณฑ์ของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [มีสัญลักษณ์์สื่อถึงประโยชน์หรือฟังก์ชั่น เช่น ช่วยลดก้อนขน]': 'packaging_18',
    'บรรจุภัณฑ์ของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [มีการการันตี เช่น ได้รับรางวัล, ยอดขายอันดับ 1]': 'packaging_19',
    'ถ้าคุณสามารถเพิ่มอะไรก็ได้เข้าไปในบรรจุภัณฑ์ของอาหารแมว คุณอยากเติมอะไร [พิมพ์ตามใจได้เลย] ': 'add_pkg_20',
#--------------------------------------------------------------------------------------
    'Option 1 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกอยากซื้อสินค้า]': 'opt1_buy',
    'Option 1 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ]': 'opt1_unique',
    'Option 1 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี]': 'opt1_premium',
    'Option 1 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน]': 'opt1_taste',
    'Option 1 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน]': 'opt1_personal',
#--------------------------------------------------------------------------------------
    'Option 2 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกอยากซื้อสินค้า]': 'opt2_buy',
    'Option 2 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ]': 'opt2_unique',
    'Option 2 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี]': 'opt2_premium',
    'Option 2 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน]': 'opt2_taste',
    'Option 2 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน]': 'opt2_personal',
#--------------------------------------------------------------------------------------
    'Option 3 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกอยากซื้อสินค้า]': 'opt3_buy',
    'Option 3 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ]': 'opt3_unique',
    'Option 3 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี]': 'opt3_premium',
    'Option 3 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน]': 'opt3_taste',
    'Option 3 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน]': 'opt3_personal',
#--------------------------------------------------------------------------------------
    'Option 4 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกอยากซื้อสินค้า]': 'opt4_buy',
    'Option 4 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ]': 'opt4_unique',
    'Option 4 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี]': 'opt4_premium',
    'Option 4 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน]': 'opt4_taste',
    'Option 4 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน]': 'opt4_personal',
#--------------------------------------------------------------------------------------
    'Option 5 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกอยากซื้อสินค้า]': 'opt5_buy',
    'Option 5 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ]': 'opt5_unique',
    'Option 5 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี]': 'opt5_premium',
    'Option 5 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน]': 'opt5_taste',
    'Option 5 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน]': 'opt5_personal',
#--------------------------------------------------------------------------------------
    'Option 6 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกอยากซื้อสินค้า]': 'opt6_buy',
    'Option 6 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ]': 'opt6_unique',
    'Option 6 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี]': 'opt6_premium',
    'Option 6 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน]': 'opt6_taste',
    'Option 6 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน]': 'opt6_personal',
#--------------------------------------------------------------------------------------
    'Option 7 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกอยากซื้อสินค้า]': 'opt7_buy',
    'Option 7 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ]': 'opt7_unique',
    'Option 7 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี]': 'opt7_premium',
    'Option 7 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน]': 'opt7_taste',
    'Option 7 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้  [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน]': 'opt7_personal',
#--------------------------------------------------------------------------------------
    'Option 8 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้ [รู้สึกอยากซื้อสินค้า]': 'opt8_buy',
    'Option 8 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้ [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ]': 'opt8_unique',
    'Option 8 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้ [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี]': 'opt8_premium',
    'Option 8 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้ [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน]': 'opt8_taste',
    'Option 8 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้ [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน]': 'opt8_personal',
#--------------------------------------------------------------------------------------
    'Option 9 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้ [รู้สึกอยากซื้อสินค้า]': 'opt9_buy',
    'Option 9 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้ [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ]': 'opt9_unique',
    'Option 9 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้ [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี]': 'opt9_premium',
    'Option 9 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้ [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน]': 'opt9_taste',
    'Option 9 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้ [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน]': 'opt9_personal',
#--------------------------------------------------------------------------------------
    'Option 10 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้ [รู้สึกอยากซื้อสินค้า]': 'opt10_buy',
    'Option 10 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้ [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ]': 'opt10_unique',
    'Option 10 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้ [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี]': 'opt10_premium',
    'Option 10 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้ [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน]': 'opt10_taste',
    'Option 10 คุณคิดเห็นอย่างไรกับการออกแบบบรรจุภัณฑ์นี้ [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน]': 'opt10_personal',
#--------------------------------------------------------------------------------------
    'จากตัวเลือกทั้งหมด คุณชอบการออกแบบบรรจุภัณฑ์อาหารแมวสำเร็จรูปแบบใดมากที่สุด 3 อันดับแรก': 'top_3'
            }

df.rename(columns=new_name, inplace=True)

#--------------------------------------------------------------------------------------
#คุณเคยซื้ออาหารแมวและมีประสบการณ์เลี้ยงแมวในบ้านหรือไม่
change_1 = {'เคย': 1, 'ไม่เคย': 0}
df['num_1'] = df['had_none_1'].map(change_1)

print("---- เคย/ไม่เคย(เลี้ยงแมว/ซื้ออาหารแมว) ----")
print(df['num_1'].value_counts().sort_index())

df = df[df['num_1'] == 1]
df = df.reset_index(drop=True)

print("---- ลบคนไม่เคย ----")
print(df['had_none_1'].value_counts())

#--------------------------------------------------------------------------------------
#อายุของคุณ

age_x = {
    "20-29ปี": 1,
    "30-39ปี": 2,
    "40-49ปี": 3,
    "50ปี ขึ้นไป": 4
}
df["age_"] = df["age_"].map(age_x)
print("---- สรุปจำนวนผู้ตอบตามช่วงอายุ ----")
print(df["age_"].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#เพศของคุณ

gender_ = {
    'ชาย': 1,
    'หญิง': 2,
    'อื่นๆ': 3
}

df['gender'] = df['gender'].map(gender_).fillna(3)

print("---- สรุปจำนวนเพศ ----")
print(df['gender'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#สถานภาพสมรส
status_ = {
    'โสด ไม่มีแฟน': 4,
    'มีแฟนแต่ยังไม่แต่งงาน': 3,
    'แต่งงานแล้ว': 2,
    'หย่าร้าง/เป็นม่าย': 1
}
df['status'] = df['status'].map(status_).fillna(3)

print("---- สรุปจำนวนสถานภาพสมรส----")
print(df['status'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#แมวมีความหมายอย่างไรต่อคุณ เช่น เป็นเหมือนลูกของเรา, เป็นเพื่อนคลายเหงา [พิมพ์ตามความรู้สึกได้เลย]

def cat_mean(text):
    text = str(text).lower()

    if any(k in text for k in ['ลูก', 'ครอบครัว', 'สมาชิก', 'family', 'everything', 'ทุกอย่าง', 'คนใน', 'ส่วนนึง', 'ขาดไม่ได้']):
        return 'family'
    
    elif any(k in text for k in ['เพื่อน', 'เหงา', 'น้อง', 'friend', 'น่ารัก', 'เจ้านาย', 'ฮีล', 'ใจ']):
        return 'friend'
    
    else:
        return 'pet'

df['mean_2'] = df['cat_mean_2'].apply(cat_mean)
print("---- ความหมายน้องแมวของคนเลี้ยง ----")
print(df['mean_2'].value_counts())

#--------------------------------------------------------------------------------------
#คุณเลี้ยงแมวพันธุ์ใด [โปรดพิมพ์ระบุ]

def cat_kind(text):
    text = str(text).lower()
    found = []
    
    if any(k in text for k in ['เปอร์เซีย', 'persian', 'british', 'บริติช', 'ragdoll', 'scottish', 'scotish', 'สก็อต',  'สก๊อต', 'สกอตต', 'munchkin', 'มัชกิ้น', 'มัชกิน', 'short', 'hair', 'shorthair', 'เมนคูน', 'dsh',  'แรคดอล', 'หิมาลายัน', 'exotic', 'อเมริกัน', 'american', 'ragamuffin']):
        found.append('inter')

    if any(k in text for k in ['ไทย', 'thai', 'วิเชียร', 'ขาวมณี', 'โกนจา', 'ศุภลักษณ์', 'โคราช', 'สีสวาท', 'พื้นเมือง']):
        found.append('thai')

    if any(k in text for k in ['ผสม', 'mix', 'จร', 'บ้าน', 'สลิด', 'ทาง', 'วัด', 'เก็บมาเลี้ยง', 'สามสี', 'ลายปลานิล', 'ธรรมดา']):
        found.append('mixed')

    return found if len(found) > 0 else ['other']

df['kind_list'] = df['cat_kind_3'].apply(cat_kind)
df_explode_3 = df.explode('kind_list')

print("---- จำนวนแมวทั้งหมด ----")
print(len(df_explode_3))
print("---- ประเภทแมวทั้งหมด ----")
print(df_explode_3['kind_list'].value_counts())

#--------------------------------------------------------------------------------------
#ปัจจุบันคุณซื้ออาหารแมวสำเร็จรูปชนิดเม็ดแบรนด์ใด[โปรดพิมพ์ระบุ] แบ่งตามกก.

def brand(text):
    text = str(text).lower()
    found = []
    
    #ราคา 250+ บาท/กก
    if any(k in text for k in ['solid gold', 'taste of the wild', 'cheershare', 'เชียร์แชร์', 'bite of wild', 'proplan', 'real power', 'instinct', 'wellness core', 'teste', 'wellnsss']): 
        found.append('premium') 

    #ราคา 120-250 บาท/กก
    if any(k in text for k in ['king', 'คิง', 'kat', 'wills', 'will', 'purino', 'purina', 'พูริโน', 'ภูริโน', 'projen', 'โปรเจน', 'petheria', 'pateria', 'kativa', 'kaniva', 'แคทิวา', 'แคททิวา', 'แคทิว่า', 'holistic', 'you-o', 'youo', 'ยูโอ', 'buzz', 'perfecta', 'tiffany', 'neez', 'justino', 'mekko', 'smartbrain', 'ostech']): 
        found.append('medium') 

    #ราคาไม่เกิน 120 บาท/กก
    if any(k in text for k in ['whiskas', 'wishkas', 'วิสกัส', 'วิสคัส', 'วิสกัต', 'friskies', 'ฟริสกี้', 'โอลิเวอร์', 'ฮีโร่', 'zoi cat', 'betagro', 'เบทราโกร', 'เบทาโกร', 'maxima', 'แม็กซิม่า']): 
        found.append('low') 
        
    return found if len(found) > 0 else ['Other']

df['brand_list'] = df['brand_4'].apply(brand)
df_exploded_4 = df.explode('brand_list')

print("---- การซื้ออาหารแต่ละแบรนด์ในตลาด(แบ่งตามช่วงราคา) ----")
print(df_exploded_4['brand_list'].value_counts())

#--------------------------------------------------------------------------------------
#คุณสมบัติของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [ใช้วัตถุดิบจากธรรมชาติ]

rating_ = {
    'มากที่สุด': 5,
    'มาก': 4,
    'ปานกลาง': 3,
    'น้อย': 2,
    'น้อยที่สุด': 1
}

df['food_natural_5'] = df['food_natural_5'].map(rating_).fillna(3)

print("---- คะแนนด้านวัตถุดิบจากธรรมชาติ ----")
print(df['food_natural_5'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#คุณสมบัติของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [ใช้วัตถุดิบนำเข้าจากต่างประเทศ เช่น เนื้อปลาทูน่าจากญี่ปุ่น]

df['food_import_6'] = df['food_import_6'].map(rating_).fillna(3)

print("---- คะแนนด้านวัตถุดิบนำเข้า ----")
print(df['food_import_6'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#คุณสมบัติของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [รสชาติกลมกล่อมอร่อยถูกปากแมว เช่น เทไว้แล้วแมวกินหมดไม่เหลือ, หยิบถุงแล้วแมวรอกิน]

df['food_taste_7'] = df['food_taste_7'].map(rating_).fillna(3)

print("---- คะแนนด้านรสชาติของอาหาร ----")
print(df['food_taste_7'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#คุณสมบัติของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [เป็นผลิตภัณฑ์จากต่างประเทศ เช่น ญี่ปุ่น, อเมริกา]

df['food_make_import_8'] = df['food_make_import_8'].map(rating_).fillna(3)

print("---- คะแนนด้านผลิตภัณฑ์จากต่างประเทศ ----")
print(df['food_make_import_8'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#คุณสมบัติของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [แบรนด์มีชื่อเสียงเป็นที่รู้จัก]

df['brand_popular_9'] = df['brand_popular_9'].map(rating_).fillna(3)

print("---- คะแนนด้านแบรนด์มีชื่อเสียงเป็นที่รู้จัก ----")
print(df['brand_popular_9'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#บรรจุภัณฑ์ (packaging) มีผลต่อการตัดสินใจซื้อใจหรือไม่

rating_1 = {
    'มีผล': 1,
    'ไม่มีผล': 0
}

df['packaging_10'] = df['packaging_10'].map(rating_1).fillna(3)

print("---- บรรจุภัณฑ์มีผลต่อการตัดสินใจซื้อมั้ย ----")
print(df['packaging_10'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#สำหรับบรรจุภัณฑ์อาหารแมว คุณชอบภาพแบบใด

rating_2 = {
    'ภาพการ์ตูน หรือลายเส้น': 3,
    'ภาพแมวจริง หรือแมวสมจริง (AI)': 2,
    'ได้ทั้งสองแบบ หากถูกใจ': 1
}
df['packaging_11'] = df['packaging_11'].map(rating_2).fillna(3)

print("---- บรรจุภัณฑ์(ชอบภาพใด) ----")
print(df['packaging_11'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#บรรจุภัณฑ์ของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [บรรจุภัณฑ์ดูดีพรีเมียม]

df['packaging_12'] = df['packaging_12'].map(rating_).fillna(3)

print("---- บรรจุภัณฑ์(บรรจุภัณฑ์ดูดีพรีเมียม) ----")
print(df['packaging_12'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#บรรจุภัณฑ์ของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [บรรจุภัณฑ์มีภาพแมว]

df['packaging_13'] = df['packaging_13'].map(rating_).fillna(3)

print("---- บรรจุภัณฑ์(บรรจุภัณฑ์มีภาพแมว) ----")
print(df['packaging_13'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#บรรจุภัณฑ์ของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [บรรจุภัณฑ์มีภาพอาหารเม็ด รูปทรงของอาหารเม็ดจริงให้เห็น]

df['packaging_14'] = df['packaging_14'].map(rating_).fillna(3)

print("---- บรรจุภัณฑ์(บรรจุภัณฑ์มีรูปทรงของอาหารเม็ดจริงให้เห็น) ----")
print(df['packaging_14'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#บรรจุภัณฑ์ของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [บรรจุภัณฑ์มีภาพวัตถุดิบและส่วนผสมจริงให้เห็น]

df['packaging_15'] = df['packaging_15'].map(rating_).fillna(3)

print("---- บรรจุภัณฑ์(บรรจุภัณฑ์มีภาพวัตถุดิบและส่วนผสมจริงให้เห็น) ----")
print(df['packaging_15'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#บรรจุภัณฑ์ของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [บรรจุภัณฑ์เป็นมิตรต่อสิ่งแวดล้อม]

df['packaging_16'] = df['packaging_16'].map(rating_).fillna(3)

print("---- บรรจุภัณฑ์(บรรจุภัณฑ์เป็นมิตรต่อสิ่งแวดล้อม) ----")
print(df['packaging_16'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#บรรจุภัณฑ์ของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [มีสัญลักษณ์สื่อถึงแหล่งผลิตหรือที่มา เช่น นำเข้าจากประเทศx]

df['packaging_17'] = df['packaging_17'].map(rating_).fillna(3)

print("---- บรรจุภัณฑ์(บรรจุภัณฑ์มีสัญลักษณ์สื่อถึงแหล่งผลิตหรือที่มา) ----")
print(df['packaging_17'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#บรรจุภัณฑ์ของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [มีสัญลักษณ์์สื่อถึงประโยชน์หรือฟังก์ชั่น เช่น ช่วยลดก้อนขน]

df['packaging_18'] = df['packaging_18'].map(rating_).fillna(3)

print("---- บรรจุภัณฑ์(บรรจุภัณฑ์มีสัญลักษณ์สื่อถึงแหล่งผลิตหรือที่มา) ----")
print(df['packaging_18'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#บรรจุภัณฑ์ของอาหารแมวสำเร็จรูปชนิดเม็ดที่ส่งผลต่อการตัดสินใจซื้อ [มีการการันตี เช่น ได้รับรางวัล, ยอดaอันดับ 1]

df['packaging_19'] = df['packaging_19'].map(rating_).fillna(3)

print("---- บรรจุภัณฑ์(บรรจุภัณฑ์มีมีการการันตี) ----")
print(df['packaging_19'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#ถ้าคุณสามารถเพิ่มอะไรก็ได้เข้าไปในบรรจุภัณฑ์ของอาหารแมว คุณอยากเติมอะไร [พิมพ์ตามใจได้เลย]

def add_pkg(text):
    if pd.isnull(text):
        return ['none']
    
    text = str(text).lower()
    found = []

    if text.strip() in ['-', 'ไม่มี', 'ไม่รู้', 'ไม่ทราบ', 'ไม่เติม', 'ไม่มีความเห็น', '.', 'none ']:
        return ['none']

    if any(k in text for k in ['ซิป', 'zip', 'กล่อง', 'ถุงใส','ที่หนีบ', 'ฝา', 'ปิด', 'เปิด', 'เก็บ', 'ถุง']):
        found.append('packaging')

    if any(k in text for k in ['โซเดียม', 'โปรตีน', 'วัตถุดิบ', 'ส่วนผสม', 'สูตร', 'สารอาหาร', 'คุณค่า', 'ไขมัน', 'aafco', 'ปริมาณ', 'คุณสมบัติ', 'วิตามิน', 'สุขภาพ', 'ก้อนขน', 'ไต', 'ตับ', 'ข้อต่อ', 'probiotic', 'ขน', 'โรค', 'ลด']):
        found.append('quality')

    if any(k in text for k in ['ของแถม', 'ของเล่น', 'ลอตเตอรี่', 'ลุ้น', 'สุ่ม', 'topping', 'ก้านขน']):
        found.append('gift')

    return found if len(found) > 0 else ['other']

df['add_pkg_list'] = df['add_pkg_20'].apply(add_pkg)
df_add_pkg = df.explode('add_pkg_list')

print("---- สิ่งที่อยากเพิ่มในบรรจุภัณฑ์ ----")
print(df_add_pkg['add_pkg_list'].value_counts())

#--------------------------------------------------------------------------------------
rating_opinion = {
    'เห็นด้วยที่สุด': 5,
    'เห็นด้วย': 4,
    'เฉยๆ': 3,
    'ไม่เห็นด้วย': 2,
    'ไม่เห็นด้วยเลย': 1
}

option_1_10 = [
    'opt1_buy', 'opt1_unique', 'opt1_premium', 'opt1_taste', 'opt1_personal',
    'opt2_buy', 'opt2_unique', 'opt2_premium', 'opt2_taste', 'opt2_personal',
    'opt3_buy', 'opt3_unique', 'opt3_premium', 'opt3_taste', 'opt3_personal',
    'opt4_buy', 'opt4_unique', 'opt4_premium', 'opt4_taste', 'opt4_personal',
    'opt5_buy', 'opt5_unique', 'opt5_premium', 'opt5_taste', 'opt5_personal',
    'opt6_buy', 'opt6_unique', 'opt6_premium', 'opt6_taste', 'opt6_personal',
    'opt7_buy', 'opt7_unique', 'opt7_premium', 'opt7_taste', 'opt7_personal',
    'opt8_buy', 'opt8_unique', 'opt8_premium', 'opt8_taste', 'opt8_personal',
    'opt9_buy', 'opt9_unique', 'opt9_premium', 'opt9_taste', 'opt9_personal',
    'opt10_buy', 'opt10_unique', 'opt10_premium', 'opt10_taste', 'opt10_personal'
]

for col in option_1_10 :
    df[col] = df[col].map(rating_opinion).fillna(3)
# เช็คผลลัพธ์ของทุกอันในคอลัมน์ Option 1 - 10 

# ==================== Option 1 ====================
print("---- Option 1 [รู้สึกอยากซื้อสินค้า] ----")
print(df['opt1_buy'].value_counts().sort_index())
print("---- Option 1 [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ] ----")
print(df['opt1_unique'].value_counts().sort_index())
print("---- Option 1 [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี] ----")
print(df['opt1_premium'].value_counts().sort_index())
print("---- Option 1 [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน] ----")
print(df['opt1_taste'].value_counts().sort_index())
print("---- Option 1 [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน] ----")
print(df['opt1_personal'].value_counts().sort_index())

# ==================== Option 2 ====================
print("---- Option 2 [รู้สึกอยากซื้อสินค้า] ----")
print(df['opt2_buy'].value_counts().sort_index())
print("---- Option 2 [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ] ----")
print(df['opt2_unique'].value_counts().sort_index())
print("---- Option 2 [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี] ----")
print(df['opt2_premium'].value_counts().sort_index())
print("---- Option 2 [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน] ----")
print(df['opt2_taste'].value_counts().sort_index())
print("---- Option 2 [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน] ----")
print(df['opt2_personal'].value_counts().sort_index())

# ==================== Option 3 ====================
print("---- Option 3 [รู้สึกอยากซื้อสินค้า] ----")
print(df['opt3_buy'].value_counts().sort_index())
print("---- Option 3 [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ] ----")
print(df['opt3_unique'].value_counts().sort_index())
print("---- Option 3 [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี] ----")
print(df['opt3_premium'].value_counts().sort_index())
print("---- Option 3 [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน] ----")
print(df['opt3_taste'].value_counts().sort_index())
print("---- Option 3 [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน] ----")
print(df['opt3_personal'].value_counts().sort_index())

# ==================== Option 4 ====================
print("---- Option 4 [รู้สึกอยากซื้อสินค้า] ----")
print(df['opt4_buy'].value_counts().sort_index())
print("---- Option 4 [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ] ----")
print(df['opt4_unique'].value_counts().sort_index())
print("---- Option 4 [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี] ----")
print(df['opt4_premium'].value_counts().sort_index())
print("---- Option 4 [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน] ----")
print(df['opt4_taste'].value_counts().sort_index())
print("---- Option 4 [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน] ----")
print(df['opt4_personal'].value_counts().sort_index())

# ==================== Option 5 ====================
print("---- Option 5 [รู้สึกอยากซื้อสินค้า] ----")
print(df['opt5_buy'].value_counts().sort_index())
print("---- Option 5 [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ] ----")
print(df['opt5_unique'].value_counts().sort_index())
print("---- Option 5 [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี] ----")
print(df['opt5_premium'].value_counts().sort_index())
print("---- Option 5 [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน] ----")
print(df['opt5_taste'].value_counts().sort_index())
print("---- Option 5 [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน] ----")
print(df['opt5_personal'].value_counts().sort_index())

# ==================== Option 6 ====================
print("---- Option 6 [รู้สึกอยากซื้อสินค้า] ----")
print(df['opt6_buy'].value_counts().sort_index())
print("---- Option 6 [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ] ----")
print(df['opt6_unique'].value_counts().sort_index())
print("---- Option 6 [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี] ----")
print(df['opt6_premium'].value_counts().sort_index())
print("---- Option 6 [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน] ----")
print(df['opt6_taste'].value_counts().sort_index())
print("---- Option 6 [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน] ----")
print(df['opt6_personal'].value_counts().sort_index())

# ==================== Option 7 ====================
print("---- Option 7 [รู้สึกอยากซื้อสินค้า] ----")
print(df['opt7_buy'].value_counts().sort_index())
print("---- Option 7 [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ] ----")
print(df['opt7_unique'].value_counts().sort_index())
print("---- Option 7 [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี] ----")
print(df['opt7_premium'].value_counts().sort_index())
print("---- Option 7 [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน] ----")
print(df['opt7_taste'].value_counts().sort_index())
print("---- Option 7 [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน] ----")
print(df['opt7_personal'].value_counts().sort_index())

# ==================== Option 8 ====================
print("---- Option 8 [รู้สึกอยากซื้อสินค้า] ----")
print(df['opt8_buy'].value_counts().sort_index())
print("---- Option 8 [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ] ----")
print(df['opt8_unique'].value_counts().sort_index())
print("---- Option 8 [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี] ----")
print(df['opt8_premium'].value_counts().sort_index())
print("---- Option 8 [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน] ----")
print(df['opt8_taste'].value_counts().sort_index())
print("---- Option 8 [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน] ----")
print(df['opt8_personal'].value_counts().sort_index())

# ==================== Option 9 ====================
print("---- Option 9 [รู้สึกอยากซื้อสินค้า] ----")
print(df['opt9_buy'].value_counts().sort_index())
print("---- Option 9 [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ] ----")
print(df['opt9_unique'].value_counts().sort_index())
print("---- Option 9 [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี] ----")
print(df['opt9_premium'].value_counts().sort_index())
print("---- Option 9 [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน] ----")
print(df['opt9_taste'].value_counts().sort_index())
print("---- Option 9 [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน] ----")
print(df['opt9_personal'].value_counts().sort_index())

# ==================== Option 10 ====================
print("---- Option 10 [รู้สึกอยากซื้อสินค้า] ----")
print(df['opt10_buy'].value_counts().sort_index())
print("---- Option 10 [รูู้สึกโดดเด่นและแตกต่างจากแบรนด์อื่นๆ] ----")
print(df['opt10_unique'].value_counts().sort_index())
print("---- Option 10 [รู้สึกว่าสินค้าพรีเมียม คุณภาพดี] ----")
print(df['opt10_premium'].value_counts().sort_index())
print("---- Option 10 [รู้สึกถึงรสชาติที่ดีกลมกล่อม แมวจะชอบทาน] ----")
print(df['opt10_taste'].value_counts().sort_index())
print("---- Option 10 [รู้สึกว่าเป็นดีไซน์ที่เหมาะกับตัวฉัน] ----")
print(df['opt10_personal'].value_counts().sort_index())

#--------------------------------------------------------------------------------------
#จากตัวเลือกทั้งหมด คุณชอบการออกแบบบรรจุภัณฑ์อาหารแมวสำเร็จรูปแบบใดมากที่สุด 3 อันดับแรก

df['top3_opt1']  = df['top_3'].str.contains('Option 1,|Option 1$').astype(int) 
# $ใช้สำหรับคนที่เลือกแบบที่1 อันสุดท้ายสุดเพื่อกันความผิดพลาดสับสนกับแบบที่10 เพราะมันจะคิดว่าเลือกแบบที่1 ไปด้วย
df['top3_opt2']  = df['top_3'].str.contains('Option 2').astype(int)
df['top3_opt3']  = df['top_3'].str.contains('Option 3').astype(int)
df['top3_opt4']  = df['top_3'].str.contains('Option 4').astype(int)
df['top3_opt5']  = df['top_3'].str.contains('Option 5').astype(int)
df['top3_opt6']  = df['top_3'].str.contains('Option 6').astype(int)
df['top3_opt7']  = df['top_3'].str.contains('Option 7').astype(int)
df['top3_opt8']  = df['top_3'].str.contains('Option 8').astype(int)
df['top3_opt9']  = df['top_3'].str.contains('Option 9').astype(int)
df['top3_opt10'] = df['top_3'].str.contains('Option 10').astype(int)

print("---- จำนวนคนที่เลือกแต่ละแบบ 3 อันดับแรก ----")
top3_cols = ['top3_opt1','top3_opt2','top3_opt3','top3_opt4','top3_opt5',
             'top3_opt6','top3_opt7','top3_opt8','top3_opt9','top3_opt10']
print(df[top3_cols].sum().sort_values(ascending=False))

#--------------------------------------------------------------------------------------

#ลบคอลัมเก่าออก
df = df.drop(columns=['had_none_1', 'cat_mean_2', 'cat_kind_3', 'brand_4', 'add_pkg_20', 'num_1', 'top_3', 'เมื่อนึกถึงบรรจุภัณฑ์อาหารแมวที่โดดเด่นและสะดุดตา คุณคิดถึงแบรนด์ใดเป็นอันดับแรก เพราะอะไร [โปรดพิมพ์ชื่อแบรนด์และเหตุผล]'  # open-ended ไม่ได้ encode
])

#--------------------------------------------------------------------------------------
df.to_csv('clean_cat.csv', index=False, encoding='utf-8-sig')
